7767517
462 555
Input                    in0                      0 1 in0
Convolution              conv_155                 1 1 in0 1 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1728
Swish                    silu_32                  1 1 1 2
Convolution              conv_156                 1 1 2 3 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_33                  1 1 3 4
Convolution              conv_157                 1 1 4 5 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_34                  1 1 5 6
Slice                    tensor_split_0           1 2 6 7 8 -23300=2,64,-233 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_158                 1 1 11 12 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_159                 1 1 10 13 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_35                  1 1 12 14
Split                    splitncnn_1              1 2 14 15 16
Swish                    silu_36                  1 1 13 17
Convolution              conv_160                 1 1 16 18 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_37                  1 1 18 19
Convolution              conv_161                 1 1 19 20 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_2              1 2 20 21 22
Sigmoid                  sigmoid_15               1 1 22 23
BinaryOp                 mul_0                    2 1 21 23 24 0=2
BinaryOp                 add_1                    2 1 15 24 25 0=0
Concat                   cat_0                    2 1 25 17 26 0=0
Convolution              conv_162                 1 1 26 27 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_38                  1 1 27 28
Convolution              conv_163                 1 1 28 29 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_39                  1 1 29 30
Split                    splitncnn_3              1 3 30 31 32 33
Convolution              conv_164                 1 1 33 34 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_165                 1 1 32 35 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_40                  1 1 34 36
Split                    splitncnn_4              1 2 36 37 38
Swish                    silu_41                  1 1 35 39
Convolution              conv_166                 1 1 38 40 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_42                  1 1 40 41
Convolution              conv_167                 1 1 41 42 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_5              1 2 42 43 44
Sigmoid                  sigmoid_16               1 1 44 45
BinaryOp                 mul_2                    2 1 43 45 46 0=2
BinaryOp                 add_3                    2 1 37 46 47 0=0
Concat                   cat_1                    2 1 47 39 48 0=0
Convolution              conv_168                 1 1 48 49 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_43                  1 1 49 50
Convolution              conv_169                 1 1 50 51 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_44                  1 1 51 52
Concat                   cat_2                    4 1 7 9 31 52 53 0=0
Convolution              conv_170                 1 1 53 54 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_45                  1 1 54 55
Pooling                  avgpool2d_0              1 1 55 56 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    tensor_split_1           1 2 56 57 58 -23300=2,128,-233 1=0
Convolution              conv_171                 1 1 57 59 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Pooling                  maxpool2d_7              1 1 58 60 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              conv_172                 1 1 60 61 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_46                  1 1 59 62
Swish                    silu_47                  1 1 61 63
Concat                   cat_3                    2 1 62 63 64 0=0
Convolution              conv_173                 1 1 64 65 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_48                  1 1 65 66
Slice                    tensor_split_2           1 2 66 67 68 -23300=2,128,-233 1=0
Split                    splitncnn_6              1 3 68 69 70 71
Convolution              conv_174                 1 1 71 72 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_175                 1 1 70 73 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_49                  1 1 72 74
Split                    splitncnn_7              1 2 74 75 76
Swish                    silu_50                  1 1 73 77
Convolution              conv_176                 1 1 76 78 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_51                  1 1 78 79
Convolution              conv_177                 1 1 79 80 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_8              1 2 80 81 82
Sigmoid                  sigmoid_17               1 1 82 83
BinaryOp                 mul_4                    2 1 81 83 84 0=2
BinaryOp                 add_5                    2 1 75 84 85 0=0
Concat                   cat_4                    2 1 85 77 86 0=0
Convolution              conv_178                 1 1 86 87 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_52                  1 1 87 88
Convolution              conv_179                 1 1 88 89 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_53                  1 1 89 90
Split                    splitncnn_9              1 3 90 91 92 93
Convolution              conv_180                 1 1 93 94 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_181                 1 1 92 95 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_54                  1 1 94 96
Split                    splitncnn_10             1 2 96 97 98
Swish                    silu_55                  1 1 95 99
Convolution              conv_182                 1 1 98 100 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_56                  1 1 100 101
Convolution              conv_183                 1 1 101 102 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_11             1 2 102 103 104
Sigmoid                  sigmoid_18               1 1 104 105
BinaryOp                 mul_6                    2 1 103 105 106 0=2
BinaryOp                 add_7                    2 1 97 106 107 0=0
Concat                   cat_5                    2 1 107 99 108 0=0
Convolution              conv_184                 1 1 108 109 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_57                  1 1 109 110
Convolution              conv_185                 1 1 110 111 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_58                  1 1 111 112
Concat                   cat_6                    4 1 67 69 91 112 113 0=0
Convolution              conv_186                 1 1 113 114 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_59                  1 1 114 115
Split                    splitncnn_12             1 2 115 116 117
Pooling                  avgpool2d_1              1 1 117 118 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    tensor_split_3           1 2 118 119 120 -23300=2,256,-233 1=0
Convolution              conv_187                 1 1 119 121 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Pooling                  maxpool2d_8              1 1 120 122 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              conv_188                 1 1 122 123 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_60                  1 1 121 124
Swish                    silu_61                  1 1 123 125
Concat                   cat_7                    2 1 124 125 126 0=0
Convolution              conv_189                 1 1 126 127 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_62                  1 1 127 128
Slice                    tensor_split_4           1 2 128 129 130 -23300=2,256,-233 1=0
Split                    splitncnn_13             1 3 130 131 132 133
Convolution              conv_190                 1 1 133 134 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_191                 1 1 132 135 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_63                  1 1 134 136
Split                    splitncnn_14             1 2 136 137 138
Swish                    silu_64                  1 1 135 139
Convolution              conv_192                 1 1 138 140 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_65                  1 1 140 141
Convolution              conv_193                 1 1 141 142 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_15             1 2 142 143 144
Sigmoid                  sigmoid_19               1 1 144 145
BinaryOp                 mul_8                    2 1 143 145 146 0=2
BinaryOp                 add_9                    2 1 137 146 147 0=0
Concat                   cat_8                    2 1 147 139 148 0=0
Convolution              conv_194                 1 1 148 149 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_66                  1 1 149 150
Convolution              conv_195                 1 1 150 151 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_67                  1 1 151 152
Split                    splitncnn_16             1 3 152 153 154 155
Convolution              conv_196                 1 1 155 156 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_197                 1 1 154 157 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_68                  1 1 156 158
Split                    splitncnn_17             1 2 158 159 160
Swish                    silu_69                  1 1 157 161
Convolution              conv_198                 1 1 160 162 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_70                  1 1 162 163
Convolution              conv_199                 1 1 163 164 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_18             1 2 164 165 166
Sigmoid                  sigmoid_20               1 1 166 167
BinaryOp                 mul_10                   2 1 165 167 168 0=2
BinaryOp                 add_11                   2 1 159 168 169 0=0
Concat                   cat_9                    2 1 169 161 170 0=0
Convolution              conv_200                 1 1 170 171 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_71                  1 1 171 172
Convolution              conv_201                 1 1 172 173 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_72                  1 1 173 174
Concat                   cat_10                   4 1 129 131 153 174 175 0=0
Convolution              conv_202                 1 1 175 176 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_73                  1 1 176 177
Split                    splitncnn_19             1 2 177 178 179
Pooling                  avgpool2d_2              1 1 179 180 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    tensor_split_5           1 2 180 181 182 -23300=2,256,-233 1=0
Convolution              conv_203                 1 1 181 183 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Pooling                  maxpool2d_9              1 1 182 184 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              conv_204                 1 1 184 185 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_74                  1 1 183 186
Swish                    silu_75                  1 1 185 187
Concat                   cat_11                   2 1 186 187 188 0=0
Convolution              conv_205                 1 1 188 189 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_76                  1 1 189 190
Slice                    tensor_split_6           1 2 190 191 192 -23300=2,256,-233 1=0
Split                    splitncnn_20             1 3 192 193 194 195
Convolution              conv_206                 1 1 195 196 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_207                 1 1 194 197 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_77                  1 1 196 198
Split                    splitncnn_21             1 2 198 199 200
Swish                    silu_78                  1 1 197 201
Convolution              conv_208                 1 1 200 202 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_79                  1 1 202 203
Convolution              conv_209                 1 1 203 204 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_22             1 2 204 205 206
Sigmoid                  sigmoid_21               1 1 206 207
BinaryOp                 mul_12                   2 1 205 207 208 0=2
BinaryOp                 add_13                   2 1 199 208 209 0=0
Concat                   cat_12                   2 1 209 201 210 0=0
Convolution              conv_210                 1 1 210 211 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_80                  1 1 211 212
Convolution              conv_211                 1 1 212 213 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_81                  1 1 213 214
Split                    splitncnn_23             1 3 214 215 216 217
Convolution              conv_212                 1 1 217 218 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_213                 1 1 216 219 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_82                  1 1 218 220
Split                    splitncnn_24             1 2 220 221 222
Swish                    silu_83                  1 1 219 223
Convolution              conv_214                 1 1 222 224 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_84                  1 1 224 225
Convolution              conv_215                 1 1 225 226 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_25             1 2 226 227 228
Sigmoid                  sigmoid_22               1 1 228 229
BinaryOp                 mul_14                   2 1 227 229 230 0=2
BinaryOp                 add_15                   2 1 221 230 231 0=0
Concat                   cat_13                   2 1 231 223 232 0=0
Convolution              conv_216                 1 1 232 233 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_85                  1 1 233 234
Convolution              conv_217                 1 1 234 235 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_86                  1 1 235 236
Concat                   cat_14                   4 1 191 193 215 236 237 0=0
Convolution              conv_218                 1 1 237 238 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_87                  1 1 238 239
Convolution              conv_219                 1 1 239 240 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_88                  1 1 240 241
Split                    splitncnn_26             1 2 241 242 243
Pooling                  maxpool2d_10             1 1 243 244 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_27             1 2 244 245 246
Pooling                  maxpool2d_11             1 1 246 247 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_28             1 2 247 248 249
Pooling                  maxpool2d_12             1 1 249 250 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_15                   4 1 242 245 248 250 251 0=0
Convolution              conv_220                 1 1 251 252 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_89                  1 1 252 253
Split                    splitncnn_29             1 2 253 254 255
Interp                   interpolate_5            1 1 255 256 0=1 1=2.0 2=2.0 6=0
Concat                   cat_16                   2 1 256 178 257 0=0
Convolution              conv_221                 1 1 257 258 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_90                  1 1 258 259
Slice                    tensor_split_7           1 2 259 260 261 -23300=2,256,-233 1=0
Split                    splitncnn_30             1 3 261 262 263 264
Convolution              conv_222                 1 1 264 265 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_223                 1 1 263 266 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_91                  1 1 265 267
Split                    splitncnn_31             1 2 267 268 269
Swish                    silu_92                  1 1 266 270
Convolution              conv_224                 1 1 269 271 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_93                  1 1 271 272
Convolution              conv_225                 1 1 272 273 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_32             1 2 273 274 275
Sigmoid                  sigmoid_23               1 1 275 276
BinaryOp                 mul_16                   2 1 274 276 277 0=2
BinaryOp                 add_17                   2 1 268 277 278 0=0
Concat                   cat_17                   2 1 278 270 279 0=0
Convolution              conv_226                 1 1 279 280 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_94                  1 1 280 281
Convolution              conv_227                 1 1 281 282 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_95                  1 1 282 283
Split                    splitncnn_33             1 3 283 284 285 286
Convolution              conv_228                 1 1 286 287 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_229                 1 1 285 288 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_96                  1 1 287 289
Split                    splitncnn_34             1 2 289 290 291
Swish                    silu_97                  1 1 288 292
Convolution              conv_230                 1 1 291 293 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_98                  1 1 293 294
Convolution              conv_231                 1 1 294 295 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_35             1 2 295 296 297
Sigmoid                  sigmoid_24               1 1 297 298
BinaryOp                 mul_18                   2 1 296 298 299 0=2
BinaryOp                 add_19                   2 1 290 299 300 0=0
Concat                   cat_18                   2 1 300 292 301 0=0
Convolution              conv_232                 1 1 301 302 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_99                  1 1 302 303
Convolution              conv_233                 1 1 303 304 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_100                 1 1 304 305
Concat                   cat_19                   4 1 260 262 284 305 306 0=0
Convolution              conv_234                 1 1 306 307 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_101                 1 1 307 308
Split                    splitncnn_36             1 2 308 309 310
Interp                   interpolate_6            1 1 310 311 0=1 1=2.0 2=2.0 6=0
Concat                   cat_20                   2 1 311 116 312 0=0
Convolution              conv_235                 1 1 312 313 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_102                 1 1 313 314
Slice                    tensor_split_8           1 2 314 315 316 -23300=2,128,-233 1=0
Split                    splitncnn_37             1 3 316 317 318 319
Convolution              conv_236                 1 1 319 320 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_237                 1 1 318 321 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_103                 1 1 320 322
Split                    splitncnn_38             1 2 322 323 324
Swish                    silu_104                 1 1 321 325
Convolution              conv_238                 1 1 324 326 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_105                 1 1 326 327
Convolution              conv_239                 1 1 327 328 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_39             1 2 328 329 330
Sigmoid                  sigmoid_25               1 1 330 331
BinaryOp                 mul_20                   2 1 329 331 332 0=2
BinaryOp                 add_21                   2 1 323 332 333 0=0
Concat                   cat_21                   2 1 333 325 334 0=0
Convolution              conv_240                 1 1 334 335 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_106                 1 1 335 336
Convolution              conv_241                 1 1 336 337 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_107                 1 1 337 338
Split                    splitncnn_40             1 3 338 339 340 341
Convolution              conv_242                 1 1 341 342 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_243                 1 1 340 343 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_108                 1 1 342 344
Split                    splitncnn_41             1 2 344 345 346
Swish                    silu_109                 1 1 343 347
Convolution              conv_244                 1 1 346 348 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_110                 1 1 348 349
Convolution              conv_245                 1 1 349 350 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_42             1 2 350 351 352
Sigmoid                  sigmoid_26               1 1 352 353
BinaryOp                 mul_22                   2 1 351 353 354 0=2
BinaryOp                 add_23                   2 1 345 354 355 0=0
Concat                   cat_22                   2 1 355 347 356 0=0
Convolution              conv_246                 1 1 356 357 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_111                 1 1 357 358
Convolution              conv_247                 1 1 358 359 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_112                 1 1 359 360
Concat                   cat_23                   4 1 315 317 339 360 361 0=0
Convolution              conv_248                 1 1 361 362 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_113                 1 1 362 363
Split                    splitncnn_43             1 3 363 364 365 366
Pooling                  avgpool2d_3              1 1 364 367 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_249                 1 1 366 368 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              conv_250                 1 1 365 369 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Slice                    tensor_split_9           1 2 367 370 371 -23300=2,128,-233 1=0
Swish                    silu_114                 1 1 368 372
Swish                    silu_115                 1 1 369 373
Convolution              conv_251                 1 1 370 374 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Pooling                  maxpool2d_13             1 1 371 375 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              conv_252                 1 1 372 376 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_253                 1 1 373 377 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Convolution              conv_254                 1 1 375 378 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_116                 1 1 374 379
Swish                    silu_117                 1 1 376 380
Swish                    silu_118                 1 1 377 381
Swish                    silu_119                 1 1 378 382
Convolution              conv_255                 1 1 380 383 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_256                 1 1 381 384 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Concat                   cat_24                   3 1 379 382 309 385 0=0
Concat                   cat_25                   2 1 383 384 386 0=0
Convolution              conv_257                 1 1 385 387 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Reshape                  reshape_301              1 1 386 388 0=1600 1=66
Swish                    silu_120                 1 1 387 389
Slice                    tensor_split_10          1 2 389 390 391 -23300=2,256,-233 1=0
Split                    splitncnn_44             1 3 391 392 393 394
Convolution              conv_258                 1 1 394 395 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_259                 1 1 393 396 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_121                 1 1 395 397
Split                    splitncnn_45             1 2 397 398 399
Swish                    silu_122                 1 1 396 400
Convolution              conv_260                 1 1 399 401 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_123                 1 1 401 402
Convolution              conv_261                 1 1 402 403 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_46             1 2 403 404 405
Sigmoid                  sigmoid_27               1 1 405 406
BinaryOp                 mul_24                   2 1 404 406 407 0=2
BinaryOp                 add_25                   2 1 398 407 408 0=0
Concat                   cat_26                   2 1 408 400 409 0=0
Convolution              conv_262                 1 1 409 410 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_124                 1 1 410 411
Convolution              conv_263                 1 1 411 412 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_125                 1 1 412 413
Split                    splitncnn_47             1 3 413 414 415 416
Convolution              conv_264                 1 1 416 417 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_265                 1 1 415 418 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_126                 1 1 417 419
Split                    splitncnn_48             1 2 419 420 421
Swish                    silu_127                 1 1 418 422
Convolution              conv_266                 1 1 421 423 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_128                 1 1 423 424
Convolution              conv_267                 1 1 424 425 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_49             1 2 425 426 427
Sigmoid                  sigmoid_28               1 1 427 428
BinaryOp                 mul_26                   2 1 426 428 429 0=2
BinaryOp                 add_27                   2 1 420 429 430 0=0
Concat                   cat_27                   2 1 430 422 431 0=0
Convolution              conv_268                 1 1 431 432 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_129                 1 1 432 433
Convolution              conv_269                 1 1 433 434 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_130                 1 1 434 435
Concat                   cat_28                   4 1 390 392 414 435 436 0=0
Convolution              conv_270                 1 1 436 437 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_131                 1 1 437 438
Split                    splitncnn_50             1 3 438 439 440 441
Pooling                  avgpool2d_4              1 1 439 442 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_271                 1 1 441 443 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Convolution              conv_272                 1 1 440 444 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648
Slice                    tensor_split_11          1 2 442 445 446 -23300=2,256,-233 1=0
Swish                    silu_132                 1 1 443 447
Swish                    silu_133                 1 1 444 448
Convolution              conv_273                 1 1 445 449 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Pooling                  maxpool2d_14             1 1 446 450 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              conv_274                 1 1 447 451 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_275                 1 1 448 452 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Convolution              conv_276                 1 1 450 453 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_134                 1 1 449 454
Swish                    silu_135                 1 1 451 455
Swish                    silu_136                 1 1 452 456
Swish                    silu_137                 1 1 453 457
Convolution              conv_277                 1 1 455 458 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_278                 1 1 456 459 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Concat                   cat_29                   3 1 454 457 254 460 0=0
Concat                   cat_30                   2 1 458 459 461 0=0
Convolution              conv_279                 1 1 460 462 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Reshape                  reshape_302              1 1 461 463 0=400 1=66
Swish                    silu_138                 1 1 462 464
Slice                    tensor_split_12          1 2 464 465 466 -23300=2,256,-233 1=0
Split                    splitncnn_51             1 3 466 467 468 469
Convolution              conv_280                 1 1 469 470 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_281                 1 1 468 471 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_139                 1 1 470 472
Split                    splitncnn_52             1 2 472 473 474
Swish                    silu_140                 1 1 471 475
Convolution              conv_282                 1 1 474 476 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_141                 1 1 476 477
Convolution              conv_283                 1 1 477 478 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_53             1 2 478 479 480
Sigmoid                  sigmoid_29               1 1 480 481
BinaryOp                 mul_28                   2 1 479 481 482 0=2
BinaryOp                 add_29                   2 1 473 482 483 0=0
Concat                   cat_31                   2 1 483 475 484 0=0
Convolution              conv_284                 1 1 484 485 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_142                 1 1 485 486
Convolution              conv_285                 1 1 486 487 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_143                 1 1 487 488
Split                    splitncnn_54             1 3 488 489 490 491
Convolution              conv_286                 1 1 491 492 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_287                 1 1 490 493 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_144                 1 1 492 494
Split                    splitncnn_55             1 2 494 495 496
Swish                    silu_145                 1 1 493 497
Convolution              conv_288                 1 1 496 498 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_146                 1 1 498 499
Convolution              conv_289                 1 1 499 500 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_56             1 2 500 501 502
Sigmoid                  sigmoid_30               1 1 502 503
BinaryOp                 mul_30                   2 1 501 503 504 0=2
BinaryOp                 add_31                   2 1 495 504 505 0=0
Concat                   cat_32                   2 1 505 497 506 0=0
Convolution              conv_290                 1 1 506 507 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_147                 1 1 507 508
Convolution              conv_291                 1 1 508 509 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_148                 1 1 509 510
Concat                   cat_33                   4 1 465 467 489 510 511 0=0
Convolution              conv_292                 1 1 511 512 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_149                 1 1 512 513
Split                    splitncnn_57             1 2 513 514 515
Convolution              conv_293                 1 1 515 516 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Convolution              conv_294                 1 1 514 517 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648
Swish                    silu_150                 1 1 516 518
Swish                    silu_151                 1 1 517 519
Convolution              conv_295                 1 1 518 520 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_296                 1 1 519 521 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_152                 1 1 520 522
Swish                    silu_153                 1 1 521 523
Convolution              conv_297                 1 1 522 524 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_298                 1 1 523 525 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Concat                   cat_34                   2 1 524 525 526 0=0
Reshape                  reshape_303              1 1 526 527 0=100 1=66
Concat                   cat_35                   3 1 388 463 527 528 0=1
Slice                    split_0                  1 2 528 529 530 -23300=2,64,2 1=0
Reshape                  reshape_304              1 1 529 531 0=2100 1=16 2=4
Sigmoid                  sigmoid_31               1 1 530 532
Permute                  permute_300              1 1 531 533 0=2
Softmax                  softmax_154              1 1 533 534 0=0 1=1
Convolution              conv_299                 1 1 534 535 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_305              1 1 535 536 0=2100 1=4
Slice                    tensor_split_13          1 2 536 537 538 -23300=2,2,-233 1=0
MemoryData               /model.22/Constant_9_output_0 0 1 539 0=2100 1=2
BinaryOp                 sub_32                   2 1 539 537 540 0=1
Split                    splitncnn_58             1 2 540 541 542
MemoryData               /model.22/Constant_10_output_0 0 1 543 0=2100 1=2
BinaryOp                 add_33                   2 1 543 538 544 0=0
Split                    splitncnn_59             1 2 544 545 546
BinaryOp                 sub_34                   2 1 545 541 547 0=1
BinaryOp                 add_35                   2 1 542 546 548 0=0
BinaryOp                 div_36                   1 1 548 549 0=3 1=1 2=2.0
Concat                   cat_36                   2 1 549 547 550 0=0
MemoryData               /model.22/Constant_12_output_0 0 1 551 0=2100
Reshape                  reshape_306              1 1 551 552 0=2100 1=1
BinaryOp                 mul_37                   2 1 550 552 553 0=2
Concat                   cat_37                   2 1 553 532 out0 0=0
